particle-iot/device-os/hal/src/rtl872x/spi_hal.cpp
    int deinit() {
        end();
        os_mutex_recursive_destroy(&mutex_);
        return SYSTEM_ERROR_NONE;
    }

    int setSettings(const SpiConfig& config, const hal_spi_config_t* spiConfig = nullptr, bool force = false) {
        CHECK_TRUE(validateConfig(rtlSpiIndex_, config), SYSTEM_ERROR_INVALID_ARGUMENT);
        // Save config
        memcpy(&config_, &config, sizeof(SpiConfig));
        if (spiConfig && spiConfig->flags) {
            config_.flags = spiConfig->flags;
        }
        // Set data mode
        setDataMode(config_.dataMode, force);
        // Set clock divider
        setClockDivider(config_.clockDiv);
        // Set bit order
        setBitOrder(config_.bitOrder);
        return SYSTEM_ERROR_NONE;
    }

    int setBitOrder(uint8_t bitOrder) {
        config_.bitOrder = bitOrder;
        if (SPI_DEV_TABLE[rtlSpiIndex_].SPIx->SSIENR & BIT_SSIENR_SSI_EN) {
            if (config_.bitOrder == MSBFIRST) {
                SSI_SetDataSwap(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, BIT_CTRLR0_TXBITSWP, DISABLE);
                SSI_SetDataSwap(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, BIT_CTRLR0_RXBITSWP, DISABLE);
            } else {
                SSI_SetDataSwap(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, BIT_CTRLR0_TXBITSWP, ENABLE);
                SSI_SetDataSwap(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, BIT_CTRLR0_RXBITSWP, ENABLE);
            }
        }
        return SYSTEM_ERROR_NONE;
    }

    int setDataMode(uint8_t dataMode, bool force = false) {
        config_.dataMode = dataMode;
        if (SPI_DEV_TABLE[rtlSpiIndex_].SPIx->SSIENR & BIT_SSIENR_SSI_EN) {
            uint32_t phase = SCPH_TOGGLES_IN_MIDDLE;
            uint32_t polarity = SCPOL_INACTIVE_IS_LOW;
            spiModeToPolAndPha(config_.dataMode, &polarity, &phase);
            uint32_t bakPol = SPI_DEV_TABLE[rtlSpiIndex_].SPIx->CTRLR0 & BIT_CTRLR0_SCPH;
            SSI_SetSclkPhase(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, phase);
            SSI_SetSclkPolarity(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, polarity);
            if (force || (bakPol != (SPI_DEV_TABLE[rtlSpiIndex_].SPIx->CTRLR0 & BIT_CTRLR0_SCPH))) {
                // PAD_PullCtrl is another slow call, avoid if settings still match
                if (polarity == SCPOL_INACTIVE_IS_LOW) {
                    PAD_PullCtrl((uint8_t)hal_pin_to_rtl_pin(sclkPin_), GPIO_PuPd_DOWN);
                } else {
                    PAD_PullCtrl((uint8_t)hal_pin_to_rtl_pin(sclkPin_), GPIO_PuPd_UP);
                }
            }
        }
        return SYSTEM_ERROR_NONE;
    }

    int setClockDivider(uint32_t clockDiv) {
        config_.clockDiv = clockDiv;
        if (SPI_DEV_TABLE[rtlSpiIndex_].SPIx->SSIENR & BIT_SSIENR_SSI_EN) {
            u32 rtlClockDivider = 256;
            clockDivToRtlClockDiv(config_.clockDiv, &rtlClockDivider);
            SSI_SetBaudDiv(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, rtlClockDivider);
            // Set sample delay for SPI0@50MHz
            if (rtlClockDivider == 2 && SPI_DEV_TABLE[rtlSpiIndex_].SPIx == SPI0_DEV) {
                SSI_SetSampleDelay(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, 0x1);
            } else {
                SSI_SetSampleDelay(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, 0x0);
            }
        }
        return SYSTEM_ERROR_NONE;
    }

    int begin(const SpiConfig& config) {
        return begin(csPin_, config, nullptr);
    }

    int begin(uint16_t csPin, const SpiConfig& config, const hal_spi_config_t* spi_config) {
        CHECK_TRUE(validateConfig(rtlSpiIndex_, config), SYSTEM_ERROR_INVALID_ARGUMENT);

        // Convert default pin to exact pin
        if (csPin == SPI_DEFAULT_SS) {
            if (spiInterface_ == HAL_SPI_INTERFACE1) {
                csPin = SS; 
            } else if (spiInterface_ == HAL_SPI_INTERFACE2) {
                csPin = SS1;
            } else {
                csPin = PIN_INVALID;
            }
        }
        // SPI slave mode doesn't allow invalid cs pin
        if ((config.spiMode == SPI_MODE_SLAVE) && !hal_pin_is_valid(csPin)) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }

        if (isEnabled()) {
            if (config_.spiMode == config.spiMode && config_.flags == (spi_config ? spi_config->flags : 0)
                    && csPin == csPin_) {
                // There is no need to reconfigure gpio, which is a pretty slow operation if settings match
                return setSettings(config);
            }
            CHECK(end());
        }

        csPin_ = csPin;

        // Allocate dma channels
        CHECK(initDmaChannels());

        // Save config
        memcpy(&config_, &config, sizeof(SpiConfig));
        if (spi_config && spi_config->flags) {
            config_.flags = spi_config->flags;
        }

        SSI_InitTypeDef SSI_InitStruct;
        SSI_StructInit(&SSI_InitStruct);

        // Configure GPIO and Role
        if (config_.spiMode == SPI_MODE_MASTER) {
            SSI_InitStruct.SPI_Role = SSI_MASTER;
            // NOTE: Extra setting for SPI0_DEV, please refer to rtl8721dhp_ssi.c
            if (rtlSpiIndex_ == 0) {
                SSI_SetRole(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, SSI_MASTER);
            }
            // FIXME: a noise is observed on the MOSI pin, adding a pullup here is not ideal,
            // fix it when we find a better way e.g. improve driving strength
            hal_gpio_mode(mosiPin_, INPUT_PULLUP);
            if (!(spi_config && (spi_config->flags & (uint32_t)HAL_SPI_CONFIG_FLAG_MOSI_ONLY))) {
                Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(sclkPin_), PINMUX_FUNCTION_SPIM);
                Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(misoPin_), PINMUX_FUNCTION_SPIM);
            }
            Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(mosiPin_), PINMUX_FUNCTION_SPIM);

            hal_gpio_write(csPin_, 1);
            hal_gpio_mode(csPin_, OUTPUT);
        } else {
            SSI_InitStruct.SPI_Role = SSI_SLAVE;
            // NOTE: Extra setting for SPI0_DEV, please refer to rtl8721dhp_ssi.c
            if (rtlSpiIndex_ == 0) {
                SSI_SetRole(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, SSI_SLAVE);
            }
            if (!(spi_config && (spi_config->flags & (uint32_t)HAL_SPI_CONFIG_FLAG_MOSI_ONLY))) {
                Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(sclkPin_), PINMUX_FUNCTION_SPIS);
                Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(misoPin_), PINMUX_FUNCTION_SPIS);
            }
            Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(mosiPin_), PINMUX_FUNCTION_SPIS);
            hal_gpio_mode(csPin_, INPUT_PULLUP);
            hal_interrupt_attach(csPin_, onSelectedHandler, this, CHANGE, nullptr);
        }
        SSI_Init(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, &SSI_InitStruct);

        hal_gpio_set_drive_strength(sclkPin_, HAL_GPIO_DRIVE_HIGH);
        hal_gpio_set_drive_strength(mosiPin_, HAL_GPIO_DRIVE_HIGH);
        hal_gpio_set_drive_strength(misoPin_, HAL_GPIO_DRIVE_HIGH);

        // Set data mode
        setDataMode(config_.dataMode, true /* force */);
        // Set clock divider
        setClockDivider(config_.clockDiv);
        // Set bit order
        setBitOrder(config_.bitOrder);

        // Set pin function
        if (!(spi_config && (spi_config->flags & (uint32_t)HAL_SPI_CONFIG_FLAG_MOSI_ONLY))) {
            hal_pin_set_function(sclkPin_, PF_SPI);
            hal_pin_set_function(misoPin_, PF_SPI);
        }
        hal_pin_set_function(mosiPin_, PF_SPI);

