particle-iot/device-os/hal/src/rtl872x/spi_hal.cpp
        // DMA is not enabled immediately
        // SSI_SetDmaEnable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, ENABLE, BIT_SHIFT_DMACR_TDMAE);
        // SSI_SetDmaEnable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, ENABLE, BIT_SHIFT_DMACR_RDMAE);

        // We don't use SPI interrupt
        SSI_INTConfig(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, (BIT_IMR_RXFIM | BIT_IMR_RXOIM | BIT_IMR_RXUIM), DISABLE);
        SSI_INTConfig(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, (BIT_IMR_TXOIM | BIT_IMR_TXEIM), DISABLE);
        InterruptRegister(interruptHandler, SPI_DEV_TABLE[rtlSpiIndex_].IrqNum, (u32)this, prio_);
        NVIC_ClearPendingIRQ(SPI_DEV_TABLE[rtlSpiIndex_].IrqNum);
        InterruptDis(SPI_DEV_TABLE[rtlSpiIndex_].IrqNum);

        // Clear dma interrupt just in case
        GDMA_ClearINT(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);

        // Update state
        status_.state = HAL_SPI_STATE_ENABLED;

        return SYSTEM_ERROR_NONE;
    }

    int end(bool ignoreGpio = false) {
        CHECK_TRUE(status_.state == HAL_SPI_STATE_ENABLED, SYSTEM_ERROR_INVALID_STATE);

        // Wait for last SPI transfer finished
        while (isBusy()) {
            ;
        }

        /* Set SSI DMA Disable */
        SSI_SetDmaEnable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, DISABLE, BIT_SHIFT_DMACR_RDMAE);
        SSI_SetDmaEnable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, DISABLE, BIT_SHIFT_DMACR_TDMAE);

        GDMA_ChCleanAutoReload(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_ChCleanAutoReload(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);

        /* Clear Pending ISR */
        GDMA_ClearINT(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);
        if (!ignoreGpio) {
            GDMA_ChnlFree(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
            GDMA_ChnlFree(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);
        }

        GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, DISABLE);
        GDMA_Cmd(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, DISABLE);

        // Set GPIO, pin function and pinmux
        if (!ignoreGpio) {
            hal_gpio_mode(sclkPin_, PIN_MODE_NONE);
            hal_gpio_mode(mosiPin_, PIN_MODE_NONE);
            hal_gpio_mode(misoPin_, PIN_MODE_NONE);
            hal_pin_set_function(sclkPin_, PF_NONE);
            hal_pin_set_function(mosiPin_, PF_NONE);
            hal_pin_set_function(misoPin_, PF_NONE);
            Pinmux_Config(hal_pin_to_rtl_pin(sclkPin_), PINMUX_FUNCTION_GPIO);
            Pinmux_Config(hal_pin_to_rtl_pin(mosiPin_), PINMUX_FUNCTION_GPIO);
            Pinmux_Config(hal_pin_to_rtl_pin(misoPin_), PINMUX_FUNCTION_GPIO);
            hal_gpio_set_drive_strength(sclkPin_, HAL_GPIO_DRIVE_DEFAULT);
            hal_gpio_set_drive_strength(mosiPin_, HAL_GPIO_DRIVE_DEFAULT);
            hal_gpio_set_drive_strength(misoPin_, HAL_GPIO_DRIVE_DEFAULT);
        }

        // Update state
        status_.state = HAL_SPI_STATE_DISABLED;
        status_.transferredLength = 0;

        return SYSTEM_ERROR_NONE;
    }

    int lock(system_tick_t timeout = 0) {
        CHECK_TRUE(hal_interrupt_is_isr() == false, SYSTEM_ERROR_INVALID_STATE);
        // FIXME: os_mutex_recursive_lock doesn't take any arguments, using trylock for now
        if (timeout) {
            return os_mutex_recursive_lock(mutex_);
        }

        return os_mutex_recursive_trylock(mutex_);
    }

    int unlock() {
        CHECK_TRUE(hal_interrupt_is_isr() == false, SYSTEM_ERROR_INVALID_STATE);
        return os_mutex_recursive_unlock(mutex_);
    }

    uint8_t transfer(uint8_t data) {
        CHECK_TRUE(isEnabled(), 0);
        CHECK_TRUE(config_.spiMode == SPI_MODE_MASTER, 0);

        // Wait for last SPI transfer finished
        while (isBusy()) {
            ;
        }

        // Wait until SPI is writeable
        while (!SSI_Writeable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx)) {
            ;
        }
        SSI_WriteData(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, data);

        // Wait until SPI is readable
        while (!SSI_Readable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx)) {
            ;
        }

        return (uint8_t)SSI_ReadData(SPI_DEV_TABLE[rtlSpiIndex_].SPIx);
    }

    static size_t findDmaBlockSize(size_t length) {
        if (length <= 0xfff) {
            return length;
        }

        // Divides evenly
        for (size_t i = 2; i < 0xfff && i <= length / 2; i++) {
            if (length % i != 0) {
                continue;
            }
            size_t block = length / i;
            // Arbitrary
            if (block <= 32) {
                break;
            }
            if (block <= 0xfff) {
                return block;
            }
        }
        // With remainder
        for (size_t i = 2; i < 0xfff && i <= length / 2; i++) {
            size_t block = length / i;
            if (block <= 0xfff) {
                return block;
            }
        }
        return 0;
    }

    int startDma() {
        // Dummy
        static volatile uint32_t dummy __attribute__((aligned(4))) = 0xffffffff;
        uint8_t* txBuf = transferConfig_.txBuf ? (uint8_t*)transferConfig_.txBuf + status_.transferredLength : (uint8_t*)&dummy;
        uint8_t* rxBuf = transferConfig_.rxBuf;

        size_t blockSize = transferConfig_.blockSize;
        size_t blockCount = transferConfig_.blockCount;
        bool multiBlock = transferConfig_.blockCount > 1;
        if (status_.transferredLength > 0) {
            blockSize = transferConfig_.remainder;
            blockCount = 0;
            multiBlock = false;
            if (rxBuf) {
                rxBuf += status_.transferredLength;
            }
        }

        if (((blockSize & 0x03) == 0) && (((uintptr_t)txBuf & 0x03) == 0) && blockSize >= 4) {
            /*  4-bytes aligned, move 4 bytes each transfer */
            txDmaInitStruct_.GDMA_SrcMsize = MsizeOne;
            txDmaInitStruct_.GDMA_SrcDataWidth = TrWidthFourBytes;
            txDmaInitStruct_.GDMA_BlockSize = blockSize >> 2;
        } else {
            txDmaInitStruct_.GDMA_SrcMsize = MsizeFour;
            txDmaInitStruct_.GDMA_SrcDataWidth = TrWidthOneByte;
            txDmaInitStruct_.GDMA_BlockSize = blockSize;
        }
        txDmaInitStruct_.GDMA_ReloadDst = 1;
        txDmaInitStruct_.GDMA_ReloadSrc = 0;
        txDmaInitStruct_.GDMA_DstMsize  = MsizeFour;
        txDmaInitStruct_.GDMA_DstDataWidth = TrWidthOneByte;
        txDmaInitStruct_.GDMA_SrcAddr = (u32)txBuf;
        txDmaInitStruct_.GDMA_SrcInc = IncType;
        if (multiBlock) {
            txDmaInitStruct_.MaxMuliBlock = blockCount;
        } else {
            txDmaInitStruct_.MaxMuliBlock = 0;
        }
        txDmaInitStruct_.MuliBlockCunt = 0;
        if (!transferConfig_.txBuf) {
            txDmaInitStruct_.GDMA_ReloadSrc = 1;
            txDmaInitStruct_.GDMA_SrcAddr = (u32)&dummy;
            txDmaInitStruct_.GDMA_SrcInc = NoChange;
        }

        if (rxBuf) {
            if (((blockSize & 0x03) == 0) && (((uintptr_t)rxBuf & 0x03) == 0) && blockSize >= 4 && config_.spiMode == SPI_MODE_MASTER) {
                /*  4-bytes aligned, move 4 bytes each transfer */
                rxDmaInitStruct_.GDMA_DstMsize = MsizeOne;
                rxDmaInitStruct_.GDMA_DstDataWidth = TrWidthFourBytes;
            } else {
                if (config_.spiMode == SPI_MODE_MASTER) {
                    rxDmaInitStruct_.GDMA_DstMsize = MsizeFour;
                } else {
                    rxDmaInitStruct_.GDMA_DstMsize = MsizeOne;
                }
                rxDmaInitStruct_.GDMA_DstDataWidth = TrWidthOneByte;
            }
            rxDmaInitStruct_.GDMA_BlockSize = blockSize;
            if (config_.spiMode == SPI_MODE_MASTER) {
                rxDmaInitStruct_.GDMA_SrcMsize = MsizeFour;
            } else {
                rxDmaInitStruct_.GDMA_SrcMsize = MsizeOne;
            }
            rxDmaInitStruct_.GDMA_SrcDataWidth = TrWidthOneByte;
            rxDmaInitStruct_.GDMA_DstAddr = (u32)rxBuf;
            rxDmaInitStruct_.GDMA_ReloadDst = 0;
            rxDmaInitStruct_.GDMA_ReloadSrc = 1;
            if (multiBlock) {
                rxDmaInitStruct_.MaxMuliBlock = blockCount;
            } else {
                rxDmaInitStruct_.MaxMuliBlock = 0;
            }
            rxDmaInitStruct_.MuliBlockCunt = 0;
            if (rxDmaInitStruct_.GDMA_DstMsize != txDmaInitStruct_.GDMA_SrcMsize) {
                // Match transfer size settings
                txDmaInitStruct_.GDMA_SrcMsize = config_.spiMode == SPI_MODE_MASTER ? MsizeFour : MsizeOne;
                txDmaInitStruct_.GDMA_SrcDataWidth = TrWidthOneByte;
                txDmaInitStruct_.GDMA_BlockSize = blockSize;
                rxDmaInitStruct_.GDMA_DstMsize = config_.spiMode == SPI_MODE_MASTER ? MsizeFour : MsizeOne;
                rxDmaInitStruct_.GDMA_DstDataWidth = TrWidthOneByte;
                rxDmaInitStruct_.GDMA_BlockSize = blockSize;
            }
        }

        /*  Enable GDMA for RX */
        if (rxBuf) {
            GDMA_Init(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, &rxDmaInitStruct_);
            GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, ENABLE);
            status_.receiving = true;
            SSI_SetDmaEnable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, ENABLE, BIT_SHIFT_DMACR_RDMAE);
        }

        /*  Enable GDMA for TX */
        GDMA_Init(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, &txDmaInitStruct_);
        GDMA_Cmd(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, ENABLE);
        status_.transmitting = true;
        SSI_SetDmaEnable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, ENABLE, BIT_SHIFT_DMACR_TDMAE);

