particle-iot/device-os/hal/src/rtl872x/spi_hal.cpp
        // Clear Pending ISR, free TX DMA resource
        uint32_t isrTypeMap = GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);
        (void)isrTypeMap;
        if (doneWithBlocks) {
            SSI_SetDmaEnable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, DISABLE, BIT_SHIFT_DMACR_TDMAE);
            status_.transmitting = false;
        }

        if (doneWithBlocks && !transferConfig_.rxBuf) {
            if (transferConfig_.txBuf) {
                status_.transferredLength += p - txDmaInitStruct_.GDMA_SrcAddr;
            } else {
                // Dummy 0xff transfer
                status_.transferredLength = status_.configuredTransferLength;
            }
            if (status_.transferredLength < status_.configuredTransferLength && transferConfig_.remainder) {
                startDma();
                return;
            }
            flushRxFifo();
            if (callbackConfig_.dmaUserCb) {
                (*callbackConfig_.dmaUserCb)();
            }
            status_.userDmaCbHandled = true;
        }
    }

    void flushDmaRxFiFo() {
        constexpr uint32_t BIT_CFGX_LO_FIFO_EMPTY = (1 << 9);
        constexpr uint32_t BIT_CFGX_LO_CH_SUSP = (1 << 8);

        if ((GDMA_BASE->CH[rxDmaInitStruct_.GDMA_ChNum].CFG_LOW & BIT_CFGX_LO_FIFO_EMPTY) == 0) {
            // Suspending DMA channel forces flushing of data into destination from GDMA FIFO
            // NOTE: The datasheet says that "there is no guarantee that the current transaction will complete", which is why we enter the busy loop below in these cases
            GDMA_BASE->CH[rxDmaInitStruct_.GDMA_ChNum].CFG_LOW |= BIT_CFGX_LO_CH_SUSP;
            __DSB();
            __ISB();
            // while ((GDMA_BASE->ChEnReg & (1 << rxDmaInitStruct_.GDMA_ChNum))) {
            //     // This loop is intended to delay until the DMA controller transfers the expected number of bytes, based off of the address returned in GDMA_GetDstAddr()
            //     // When a DMA transaction is near the end of a block (within the last 4 bytes), sometimes the address returned does not increment to the expected destination. In some cases it resets completely.
            //     // To work around this, we poll the ChEnReg bit for the RX DMA channel. The data sheet says it is: "automatically cleared by hardware when the DMA transfer to the destination is complete".
            //     // The assumption is that if we see this bit is cleared, then the transfer is complete, the data we wanted flushed is available, there is no point to waiting any longer and we can return.
            // }
            GDMA_BASE->CH[rxDmaInitStruct_.GDMA_ChNum].CFG_LOW &= ~(BIT_CFGX_LO_CH_SUSP);
            __DSB();
            __ISB();
        }
    }

    void dmaRxHandlerImpl(bool forceStop = false) {
        // Clear Pending ISR, free RX DMA resource
        rxDmaInitStruct_.MuliBlockCunt++;

        bool doneWithBlocks = forceStop;

        if (forceStop) {
            flushDmaRxFiFo();
        }

        // IMPORTANT: needs to be caught here before any of the GDMA calls are done
        uint32_t p = GDMA_GetDstAddr(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);

        if (!rxDmaInitStruct_.MaxMuliBlock || rxDmaInitStruct_.MuliBlockCunt == rxDmaInitStruct_.MaxMuliBlock) {
            GDMA_ChCleanAutoReload(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
            GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, DISABLE);
            doneWithBlocks = true;
        } else if (rxDmaInitStruct_.MaxMuliBlock && rxDmaInitStruct_.MuliBlockCunt == rxDmaInitStruct_.MaxMuliBlock - 1) {
            GDMA_ChCleanAutoReload(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        }

        uint32_t isrTypeMap = GDMA_ClearINT(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        (void)isrTypeMap;

        if (doneWithBlocks) {
            SSI_SetDmaEnable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, DISABLE, BIT_SHIFT_DMACR_RDMAE);
            status_.receiving = false;
        }

        if (doneWithBlocks) {
            status_.transferredLength += p - rxDmaInitStruct_.GDMA_DstAddr;
            if (status_.transferredLength < status_.configuredTransferLength && transferConfig_.remainder) {
                startDma();
                return;
            }
            flushRxFifo();
            DCache_Invalidate((u32)transferConfig_.rxBuf, status_.configuredTransferLength);
            
            if (callbackConfig_.dmaUserCb) {
                (*callbackConfig_.dmaUserCb)();
            }
            status_.userDmaCbHandled = true;
        }
    }

    void onSelectedHandlerImpl() {
        status_.csPinSelected = !hal_gpio_read(csPin_);
        if (callbackConfig_.selectUserCb) {
            (*callbackConfig_.selectUserCb)(status_.csPinSelected);
        }

        if (isDmaBufferConfigured()) {
            if (status_.csPinSelected) {
                status_.userDmaCbHandled = false;
                if (!isBusy()) {
                    status_.transferredLength = 0;
                    startDma();
                }
            } else {
                GDMA_INTConfig(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, 0x1f, DISABLE);
                GDMA_INTConfig(txDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, 0x1f, DISABLE);
                if (status_.transmitting) {
                    dmaTxHandlerImpl(true);
                }
                if (status_.receiving) {
                    dmaRxHandlerImpl(true);
                }
                transferDmaCancel(true);
            }
        }
    }

    static bool validateConfig(int rtlSpiIndex, const SpiConfig& config) {
        CHECK_TRUE(config.spiMode == SPI_MODE_MASTER ||
                   config.spiMode == SPI_MODE_SLAVE, false);
        CHECK_TRUE(config.dataMode == SPI_MODE0 ||
                   config.dataMode == SPI_MODE1 ||
                   config.dataMode == SPI_MODE2 ||
                   config.dataMode == SPI_MODE3, false);
        CHECK_TRUE(config.bitOrder == MSBFIRST ||
                   config.bitOrder == LSBFIRST, false);
        // SPI0 can work as master and slave while SPI1 can only work as master.
        CHECK_FALSE(rtlSpiIndex == 1 && config.spiMode == SPI_MODE_SLAVE, false);
        return true;
    }

    static uint32_t interruptHandler(void* context) {
        Spi* spiInstance = (Spi*)context;
        spiInstance->interruptHandlerImpl();
        return SYSTEM_ERROR_NONE;
    }

    static u32 dmaTxHandler(void* context) {
        Spi* spiInstance = (Spi*)context;
        spiInstance->dmaTxHandlerImpl();
        return 0;
    }

    static u32 dmaRxHandler(void* context) {
        Spi* spiInstance = (Spi*)context;
        spiInstance->dmaRxHandlerImpl();
        return 0;
    }

    static void onSelectedHandler(void* context) {
        Spi* spiInstance = (Spi*)context;
        spiInstance->onSelectedHandlerImpl();
    }

